analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gpio_regs.h
/**
 * @file    gpio_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the GPIO Peripheral Module.
 * @note    This file is @generated.
 * @ingroup gpio_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. All Rights Reserved.
 * (now owned by Analog Devices, Inc.),
 * Copyright (C) 2023 Analog Devices, Inc. All Rights Reserved. This software
 * is proprietary to Analog Devices, Inc. and its licensors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_GPIO_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_GPIO_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     gpio
 * @defgroup    gpio_registers GPIO_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the GPIO Peripheral Module.
 * @details     Individual I/O for each GPIO
 */

/**
 * @ingroup gpio_registers
 * Structure type to access the GPIO Registers.
 */
typedef struct {
    __IO uint32_t en;                   /**< <tt>\b 0x00:</tt> GPIO EN Register */
    __IO uint32_t en_set;               /**< <tt>\b 0x04:</tt> GPIO EN_SET Register */
    __IO uint32_t en_clr;               /**< <tt>\b 0x08:</tt> GPIO EN_CLR Register */
    __IO uint32_t out_en;               /**< <tt>\b 0x0C:</tt> GPIO OUT_EN Register */
    __IO uint32_t out_en_set;           /**< <tt>\b 0x10:</tt> GPIO OUT_EN_SET Register */
    __IO uint32_t out_en_clr;           /**< <tt>\b 0x14:</tt> GPIO OUT_EN_CLR Register */
    __IO uint32_t out;                  /**< <tt>\b 0x18:</tt> GPIO OUT Register */
    __O  uint32_t out_set;              /**< <tt>\b 0x1C:</tt> GPIO OUT_SET Register */
    __O  uint32_t out_clr;              /**< <tt>\b 0x20:</tt> GPIO OUT_CLR Register */
    __I  uint32_t in;                   /**< <tt>\b 0x24:</tt> GPIO IN Register */
    __IO uint32_t int_mode;             /**< <tt>\b 0x28:</tt> GPIO INT_MODE Register */
    __IO uint32_t int_pol;              /**< <tt>\b 0x2C:</tt> GPIO INT_POL Register */
    __IO uint32_t in_en;                /**< <tt>\b 0x30:</tt> GPIO IN_EN Register */
    __IO uint32_t int_en;               /**< <tt>\b 0x34:</tt> GPIO INT_EN Register */
    __IO uint32_t int_en_set;           /**< <tt>\b 0x38:</tt> GPIO INT_EN_SET Register */
    __IO uint32_t int_en_clr;           /**< <tt>\b 0x3C:</tt> GPIO INT_EN_CLR Register */
    __I  uint32_t int_stat;             /**< <tt>\b 0x40:</tt> GPIO INT_STAT Register */
    __R  uint32_t rsv_0x44;
    __IO uint32_t int_clr;              /**< <tt>\b 0x48:</tt> GPIO INT_CLR Register */
    __IO uint32_t wake_en;              /**< <tt>\b 0x4C:</tt> GPIO WAKE_EN Register */
    __IO uint32_t wake_en_set;          /**< <tt>\b 0x50:</tt> GPIO WAKE_EN_SET Register */
    __IO uint32_t wake_en_clr;          /**< <tt>\b 0x54:</tt> GPIO WAKE_EN_CLR Register */
    __R  uint32_t rsv_0x58;
    __IO uint32_t int_dual_edge;        /**< <tt>\b 0x5C:</tt> GPIO INT_DUAL_EDGE Register */
    __IO uint32_t pdpu_sel0;            /**< <tt>\b 0x60:</tt> GPIO PDPU_SEL0 Register */
    __IO uint32_t pdpu_sel1;            /**< <tt>\b 0x64:</tt> GPIO PDPU_SEL1 Register */
    __IO uint32_t af_sel;               /**< <tt>\b 0x68:</tt> GPIO AF_SEL Register */
    __IO uint32_t af_sel_set;           /**< <tt>\b 0x6C:</tt> GPIO AF_SEL_SET Register */
    __IO uint32_t af_sel_clr;           /**< <tt>\b 0x70:</tt> GPIO AF_SEL_CLR Register */
    __R  uint32_t rsv_0x74_0xaf[15];
    __IO uint32_t ds_sel0;              /**< <tt>\b 0xB0:</tt> GPIO DS_SEL0 Register */
    __IO uint32_t ds_sel1;              /**< <tt>\b 0xB4:</tt> GPIO DS_SEL1 Register */
    __IO uint32_t pssel;                /**< <tt>\b 0xB8:</tt> GPIO PSSEL Register */
    __R  uint32_t rsv_0xbc;
    __IO uint32_t vssel;                /**< <tt>\b 0xC0:</tt> GPIO VSSEL Register */
} mxc_gpio_regs_t;

/* Register offsets for module GPIO */
/**
 * @ingroup    gpio_registers
 * @defgroup   GPIO_Register_Offsets Register Offsets
 * @brief      GPIO Peripheral Register Offsets from the GPIO Base Peripheral Address.
 * @{
 */
#define MXC_R_GPIO_EN                      ((uint32_t)0x00000000UL) /**< Offset from GPIO Base Address: <tt> 0x0000</tt> */
#define MXC_R_GPIO_EN_SET                  ((uint32_t)0x00000004UL) /**< Offset from GPIO Base Address: <tt> 0x0004</tt> */
#define MXC_R_GPIO_EN_CLR                  ((uint32_t)0x00000008UL) /**< Offset from GPIO Base Address: <tt> 0x0008</tt> */
#define MXC_R_GPIO_OUT_EN                  ((uint32_t)0x0000000CUL) /**< Offset from GPIO Base Address: <tt> 0x000C</tt> */
#define MXC_R_GPIO_OUT_EN_SET              ((uint32_t)0x00000010UL) /**< Offset from GPIO Base Address: <tt> 0x0010</tt> */
#define MXC_R_GPIO_OUT_EN_CLR              ((uint32_t)0x00000014UL) /**< Offset from GPIO Base Address: <tt> 0x0014</tt> */
#define MXC_R_GPIO_OUT                     ((uint32_t)0x00000018UL) /**< Offset from GPIO Base Address: <tt> 0x0018</tt> */
#define MXC_R_GPIO_OUT_SET                 ((uint32_t)0x0000001CUL) /**< Offset from GPIO Base Address: <tt> 0x001C</tt> */
#define MXC_R_GPIO_OUT_CLR                 ((uint32_t)0x00000020UL) /**< Offset from GPIO Base Address: <tt> 0x0020</tt> */
#define MXC_R_GPIO_IN                      ((uint32_t)0x00000024UL) /**< Offset from GPIO Base Address: <tt> 0x0024</tt> */
#define MXC_R_GPIO_INT_MODE                ((uint32_t)0x00000028UL) /**< Offset from GPIO Base Address: <tt> 0x0028</tt> */
#define MXC_R_GPIO_INT_POL                 ((uint32_t)0x0000002CUL) /**< Offset from GPIO Base Address: <tt> 0x002C</tt> */
#define MXC_R_GPIO_IN_EN                   ((uint32_t)0x00000030UL) /**< Offset from GPIO Base Address: <tt> 0x0030</tt> */
#define MXC_R_GPIO_INT_EN                  ((uint32_t)0x00000034UL) /**< Offset from GPIO Base Address: <tt> 0x0034</tt> */
#define MXC_R_GPIO_INT_EN_SET              ((uint32_t)0x00000038UL) /**< Offset from GPIO Base Address: <tt> 0x0038</tt> */
#define MXC_R_GPIO_INT_EN_CLR              ((uint32_t)0x0000003CUL) /**< Offset from GPIO Base Address: <tt> 0x003C</tt> */
#define MXC_R_GPIO_INT_STAT                ((uint32_t)0x00000040UL) /**< Offset from GPIO Base Address: <tt> 0x0040</tt> */
#define MXC_R_GPIO_INT_CLR                 ((uint32_t)0x00000048UL) /**< Offset from GPIO Base Address: <tt> 0x0048</tt> */
#define MXC_R_GPIO_WAKE_EN                 ((uint32_t)0x0000004CUL) /**< Offset from GPIO Base Address: <tt> 0x004C</tt> */
#define MXC_R_GPIO_WAKE_EN_SET             ((uint32_t)0x00000050UL) /**< Offset from GPIO Base Address: <tt> 0x0050</tt> */
#define MXC_R_GPIO_WAKE_EN_CLR             ((uint32_t)0x00000054UL) /**< Offset from GPIO Base Address: <tt> 0x0054</tt> */
#define MXC_R_GPIO_INT_DUAL_EDGE           ((uint32_t)0x0000005CUL) /**< Offset from GPIO Base Address: <tt> 0x005C</tt> */
#define MXC_R_GPIO_PDPU_SEL0               ((uint32_t)0x00000060UL) /**< Offset from GPIO Base Address: <tt> 0x0060</tt> */
#define MXC_R_GPIO_PDPU_SEL1               ((uint32_t)0x00000064UL) /**< Offset from GPIO Base Address: <tt> 0x0064</tt> */
#define MXC_R_GPIO_AF_SEL                  ((uint32_t)0x00000068UL) /**< Offset from GPIO Base Address: <tt> 0x0068</tt> */
#define MXC_R_GPIO_AF_SEL_SET              ((uint32_t)0x0000006CUL) /**< Offset from GPIO Base Address: <tt> 0x006C</tt> */
#define MXC_R_GPIO_AF_SEL_CLR              ((uint32_t)0x00000070UL) /**< Offset from GPIO Base Address: <tt> 0x0070</tt> */
#define MXC_R_GPIO_DS_SEL0                 ((uint32_t)0x000000B0UL) /**< Offset from GPIO Base Address: <tt> 0x00B0</tt> */
#define MXC_R_GPIO_DS_SEL1                 ((uint32_t)0x000000B4UL) /**< Offset from GPIO Base Address: <tt> 0x00B4</tt> */
#define MXC_R_GPIO_PSSEL                   ((uint32_t)0x000000B8UL) /**< Offset from GPIO Base Address: <tt> 0x00B8</tt> */
#define MXC_R_GPIO_VSSEL                   ((uint32_t)0x000000C0UL) /**< Offset from GPIO Base Address: <tt> 0x00C0</tt> */
/**@} end of group gpio_registers */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_EN GPIO_EN
 * @brief    GPIO Function Enable Register. Each bit controls the GPIO_EN setting for one
 *           GPIO pin on the associated port.
 * @{
 */
#define MXC_F_GPIO_EN_GPIO_EN_POS                      0 /**< EN_GPIO_EN Position */
#define MXC_F_GPIO_EN_GPIO_EN                          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_EN_GPIO_EN_POS)) /**< EN_GPIO_EN Mask */
#define MXC_V_GPIO_EN_GPIO_EN_ALTERNATE                ((uint32_t)0x0UL) /**< EN_GPIO_EN_ALTERNATE Value */
#define MXC_S_GPIO_EN_GPIO_EN_ALTERNATE                (MXC_V_GPIO_EN_GPIO_EN_ALTERNATE << MXC_F_GPIO_EN_GPIO_EN_POS) /**< EN_GPIO_EN_ALTERNATE Setting */
#define MXC_V_GPIO_EN_GPIO_EN_GPIO                     ((uint32_t)0x1UL) /**< EN_GPIO_EN_GPIO Value */
#define MXC_S_GPIO_EN_GPIO_EN_GPIO                     (MXC_V_GPIO_EN_GPIO_EN_GPIO << MXC_F_GPIO_EN_GPIO_EN_POS) /**< EN_GPIO_EN_GPIO Setting */

/**@} end of group GPIO_EN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_EN_SET GPIO_EN_SET
 * @brief    GPIO Set Function Enable Register. Writing a 1 to one or more bits in this
 *           register sets the bits in the same positions in GPIO_EN to 1, without affecting
 *           other bits in that register.
 * @{
 */
#define MXC_F_GPIO_EN_SET_GPIO_EN_SET_POS              0 /**< EN_SET_GPIO_EN_SET Position */
#define MXC_F_GPIO_EN_SET_GPIO_EN_SET                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_EN_SET_GPIO_EN_SET_POS)) /**< EN_SET_GPIO_EN_SET Mask */
#define MXC_V_GPIO_EN_SET_GPIO_EN_SET_NO               ((uint32_t)0x0UL) /**< EN_SET_GPIO_EN_SET_NO Value */
#define MXC_S_GPIO_EN_SET_GPIO_EN_SET_NO               (MXC_V_GPIO_EN_SET_GPIO_EN_SET_NO << MXC_F_GPIO_EN_SET_GPIO_EN_SET_POS) /**< EN_SET_GPIO_EN_SET_NO Setting */
#define MXC_V_GPIO_EN_SET_GPIO_EN_SET_SET              ((uint32_t)0x1UL) /**< EN_SET_GPIO_EN_SET_SET Value */
#define MXC_S_GPIO_EN_SET_GPIO_EN_SET_SET              (MXC_V_GPIO_EN_SET_GPIO_EN_SET_SET << MXC_F_GPIO_EN_SET_GPIO_EN_SET_POS) /**< EN_SET_GPIO_EN_SET_SET Setting */

/**@} end of group GPIO_EN_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_EN_CLR GPIO_EN_CLR
 * @brief    GPIO Clear Function Enable Register. Writing a 1 to one or more bits in this
 *           register clears the bits in the same positions in GPIO_EN to 0, without
 *           affecting other bits in that register.
 * @{
 */
#define MXC_F_GPIO_EN_CLR_GPIO_EN_CLR_POS              0 /**< EN_CLR_GPIO_EN_CLR Position */
#define MXC_F_GPIO_EN_CLR_GPIO_EN_CLR                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_EN_CLR_GPIO_EN_CLR_POS)) /**< EN_CLR_GPIO_EN_CLR Mask */
#define MXC_V_GPIO_EN_CLR_GPIO_EN_CLR_NO               ((uint32_t)0x0UL) /**< EN_CLR_GPIO_EN_CLR_NO Value */
#define MXC_S_GPIO_EN_CLR_GPIO_EN_CLR_NO               (MXC_V_GPIO_EN_CLR_GPIO_EN_CLR_NO << MXC_F_GPIO_EN_CLR_GPIO_EN_CLR_POS) /**< EN_CLR_GPIO_EN_CLR_NO Setting */
#define MXC_V_GPIO_EN_CLR_GPIO_EN_CLR_CLEAR            ((uint32_t)0x1UL) /**< EN_CLR_GPIO_EN_CLR_CLEAR Value */
#define MXC_S_GPIO_EN_CLR_GPIO_EN_CLR_CLEAR            (MXC_V_GPIO_EN_CLR_GPIO_EN_CLR_CLEAR << MXC_F_GPIO_EN_CLR_GPIO_EN_CLR_POS) /**< EN_CLR_GPIO_EN_CLR_CLEAR Setting */

/**@} end of group GPIO_EN_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT_EN GPIO_OUT_EN
 * @brief    GPIO Output Enable Register. Each bit controls the GPIO_OUT_EN setting for one
 *           GPIO pin in the associated port.
 * @{
 */
#define MXC_F_GPIO_OUT_EN_GPIO_OUT_EN_POS              0 /**< OUT_EN_GPIO_OUT_EN Position */
#define MXC_F_GPIO_OUT_EN_GPIO_OUT_EN                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_EN_GPIO_OUT_EN_POS)) /**< OUT_EN_GPIO_OUT_EN Mask */
#define MXC_V_GPIO_OUT_EN_GPIO_OUT_EN_DIS              ((uint32_t)0x0UL) /**< OUT_EN_GPIO_OUT_EN_DIS Value */
#define MXC_S_GPIO_OUT_EN_GPIO_OUT_EN_DIS              (MXC_V_GPIO_OUT_EN_GPIO_OUT_EN_DIS << MXC_F_GPIO_OUT_EN_GPIO_OUT_EN_POS) /**< OUT_EN_GPIO_OUT_EN_DIS Setting */
#define MXC_V_GPIO_OUT_EN_GPIO_OUT_EN_EN               ((uint32_t)0x1UL) /**< OUT_EN_GPIO_OUT_EN_EN Value */
#define MXC_S_GPIO_OUT_EN_GPIO_OUT_EN_EN               (MXC_V_GPIO_OUT_EN_GPIO_OUT_EN_EN << MXC_F_GPIO_OUT_EN_GPIO_OUT_EN_POS) /**< OUT_EN_GPIO_OUT_EN_EN Setting */

/**@} end of group GPIO_OUT_EN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT_EN_SET GPIO_OUT_EN_SET
 * @brief    GPIO Output Enable Set Function Enable Register. Writing a 1 to one or more bits
 *           in this register sets the bits in the same positions in GPIO_OUT_EN to 1,
 *           without affecting other bits in that register.
 * @{
 */
#define MXC_F_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_POS      0 /**< OUT_EN_SET_GPIO_OUT_EN_SET Position */
#define MXC_F_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_POS)) /**< OUT_EN_SET_GPIO_OUT_EN_SET Mask */
#define MXC_V_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_NO       ((uint32_t)0x0UL) /**< OUT_EN_SET_GPIO_OUT_EN_SET_NO Value */
#define MXC_S_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_NO       (MXC_V_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_NO << MXC_F_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_POS) /**< OUT_EN_SET_GPIO_OUT_EN_SET_NO Setting */
#define MXC_V_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_SET      ((uint32_t)0x1UL) /**< OUT_EN_SET_GPIO_OUT_EN_SET_SET Value */
#define MXC_S_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_SET      (MXC_V_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_SET << MXC_F_GPIO_OUT_EN_SET_GPIO_OUT_EN_SET_POS) /**< OUT_EN_SET_GPIO_OUT_EN_SET_SET Setting */

