analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gpio_regs.h
/**@} end of group GPIO_OUT_EN_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT_EN_CLR GPIO_OUT_EN_CLR
 * @brief    GPIO Output Enable Clear Function Enable Register. Writing a 1 to one or more
 *           bits in this register clears the bits in the same positions in GPIO_OUT_EN to 0,
 *           without affecting other bits in that register.
 * @{
 */
#define MXC_F_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_POS      0 /**< OUT_EN_CLR_GPIO_OUT_EN_CLR Position */
#define MXC_F_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_POS)) /**< OUT_EN_CLR_GPIO_OUT_EN_CLR Mask */
#define MXC_V_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_NO       ((uint32_t)0x0UL) /**< OUT_EN_CLR_GPIO_OUT_EN_CLR_NO Value */
#define MXC_S_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_NO       (MXC_V_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_NO << MXC_F_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_POS) /**< OUT_EN_CLR_GPIO_OUT_EN_CLR_NO Setting */
#define MXC_V_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_CLEAR    ((uint32_t)0x1UL) /**< OUT_EN_CLR_GPIO_OUT_EN_CLR_CLEAR Value */
#define MXC_S_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_CLEAR    (MXC_V_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_CLEAR << MXC_F_GPIO_OUT_EN_CLR_GPIO_OUT_EN_CLR_POS) /**< OUT_EN_CLR_GPIO_OUT_EN_CLR_CLEAR Setting */

/**@} end of group GPIO_OUT_EN_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT GPIO_OUT
 * @brief    GPIO Output Register. Each bit controls the GPIO_OUT setting for one pin in the
 *           associated port.  This register can be written either directly, or by using the
 *           GPIO_OUT_SET and GPIO_OUT_CLR registers.
 * @{
 */
#define MXC_F_GPIO_OUT_GPIO_OUT_POS                    0 /**< OUT_GPIO_OUT Position */
#define MXC_F_GPIO_OUT_GPIO_OUT                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_GPIO_OUT_POS)) /**< OUT_GPIO_OUT Mask */
#define MXC_V_GPIO_OUT_GPIO_OUT_LOW                    ((uint32_t)0x0UL) /**< OUT_GPIO_OUT_LOW Value */
#define MXC_S_GPIO_OUT_GPIO_OUT_LOW                    (MXC_V_GPIO_OUT_GPIO_OUT_LOW << MXC_F_GPIO_OUT_GPIO_OUT_POS) /**< OUT_GPIO_OUT_LOW Setting */
#define MXC_V_GPIO_OUT_GPIO_OUT_HIGH                   ((uint32_t)0x1UL) /**< OUT_GPIO_OUT_HIGH Value */
#define MXC_S_GPIO_OUT_GPIO_OUT_HIGH                   (MXC_V_GPIO_OUT_GPIO_OUT_HIGH << MXC_F_GPIO_OUT_GPIO_OUT_POS) /**< OUT_GPIO_OUT_HIGH Setting */

/**@} end of group GPIO_OUT_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT_SET GPIO_OUT_SET
 * @brief    GPIO Output Set. Writing a 1 to one or more bits in this register sets the bits
 *           in the same positions in GPIO_OUT to 1, without affecting other bits in that
 *           register.
 * @{
 */
#define MXC_F_GPIO_OUT_SET_GPIO_OUT_SET_POS            0 /**< OUT_SET_GPIO_OUT_SET Position */
#define MXC_F_GPIO_OUT_SET_GPIO_OUT_SET                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_SET_GPIO_OUT_SET_POS)) /**< OUT_SET_GPIO_OUT_SET Mask */
#define MXC_V_GPIO_OUT_SET_GPIO_OUT_SET_NO             ((uint32_t)0x0UL) /**< OUT_SET_GPIO_OUT_SET_NO Value */
#define MXC_S_GPIO_OUT_SET_GPIO_OUT_SET_NO             (MXC_V_GPIO_OUT_SET_GPIO_OUT_SET_NO << MXC_F_GPIO_OUT_SET_GPIO_OUT_SET_POS) /**< OUT_SET_GPIO_OUT_SET_NO Setting */
#define MXC_V_GPIO_OUT_SET_GPIO_OUT_SET_SET            ((uint32_t)0x1UL) /**< OUT_SET_GPIO_OUT_SET_SET Value */
#define MXC_S_GPIO_OUT_SET_GPIO_OUT_SET_SET            (MXC_V_GPIO_OUT_SET_GPIO_OUT_SET_SET << MXC_F_GPIO_OUT_SET_GPIO_OUT_SET_POS) /**< OUT_SET_GPIO_OUT_SET_SET Setting */

/**@} end of group GPIO_OUT_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_OUT_CLR GPIO_OUT_CLR
 * @brief    GPIO Output Clear. Writing a 1 to one or more bits in this register clears the
 *           bits in the same positions in GPIO_OUT to 0, without affecting other bits in
 *           that register.
 * @{
 */
#define MXC_F_GPIO_OUT_CLR_GPIO_OUT_CLR_POS            0 /**< OUT_CLR_GPIO_OUT_CLR Position */
#define MXC_F_GPIO_OUT_CLR_GPIO_OUT_CLR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_OUT_CLR_GPIO_OUT_CLR_POS)) /**< OUT_CLR_GPIO_OUT_CLR Mask */
#define MXC_V_GPIO_OUT_CLR_GPIO_OUT_CLR_NO             ((uint32_t)0x0UL) /**< OUT_CLR_GPIO_OUT_CLR_NO Value */
#define MXC_S_GPIO_OUT_CLR_GPIO_OUT_CLR_NO             (MXC_V_GPIO_OUT_CLR_GPIO_OUT_CLR_NO << MXC_F_GPIO_OUT_CLR_GPIO_OUT_CLR_POS) /**< OUT_CLR_GPIO_OUT_CLR_NO Setting */
#define MXC_V_GPIO_OUT_CLR_GPIO_OUT_CLR_CLEAR          ((uint32_t)0x1UL) /**< OUT_CLR_GPIO_OUT_CLR_CLEAR Value */
#define MXC_S_GPIO_OUT_CLR_GPIO_OUT_CLR_CLEAR          (MXC_V_GPIO_OUT_CLR_GPIO_OUT_CLR_CLEAR << MXC_F_GPIO_OUT_CLR_GPIO_OUT_CLR_POS) /**< OUT_CLR_GPIO_OUT_CLR_CLEAR Setting */

/**@} end of group GPIO_OUT_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_IN GPIO_IN
 * @brief    GPIO Input Register. Read-only register to read from the logic states of the
 *           GPIO pins on this port.
 * @{
 */
#define MXC_F_GPIO_IN_GPIO_IN_POS                      0 /**< IN_GPIO_IN Position */
#define MXC_F_GPIO_IN_GPIO_IN                          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_IN_GPIO_IN_POS)) /**< IN_GPIO_IN Mask */
#define MXC_V_GPIO_IN_GPIO_IN_LOW                      ((uint32_t)0x0UL) /**< IN_GPIO_IN_LOW Value */
#define MXC_S_GPIO_IN_GPIO_IN_LOW                      (MXC_V_GPIO_IN_GPIO_IN_LOW << MXC_F_GPIO_IN_GPIO_IN_POS) /**< IN_GPIO_IN_LOW Setting */
#define MXC_V_GPIO_IN_GPIO_IN_HIGH                     ((uint32_t)0x1UL) /**< IN_GPIO_IN_HIGH Value */
#define MXC_S_GPIO_IN_GPIO_IN_HIGH                     (MXC_V_GPIO_IN_GPIO_IN_HIGH << MXC_F_GPIO_IN_GPIO_IN_POS) /**< IN_GPIO_IN_HIGH Setting */

/**@} end of group GPIO_IN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_MODE GPIO_INT_MODE
 * @brief    GPIO Interrupt Mode Register. Each bit in this register controls the interrupt
 *           mode setting for the associated GPIO pin on this port.
 * @{
 */
#define MXC_F_GPIO_INT_MODE_GPIO_INT_MODE_POS          0 /**< INT_MODE_GPIO_INT_MODE Position */
#define MXC_F_GPIO_INT_MODE_GPIO_INT_MODE              ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_MODE_GPIO_INT_MODE_POS)) /**< INT_MODE_GPIO_INT_MODE Mask */
#define MXC_V_GPIO_INT_MODE_GPIO_INT_MODE_LEVEL        ((uint32_t)0x0UL) /**< INT_MODE_GPIO_INT_MODE_LEVEL Value */
#define MXC_S_GPIO_INT_MODE_GPIO_INT_MODE_LEVEL        (MXC_V_GPIO_INT_MODE_GPIO_INT_MODE_LEVEL << MXC_F_GPIO_INT_MODE_GPIO_INT_MODE_POS) /**< INT_MODE_GPIO_INT_MODE_LEVEL Setting */
#define MXC_V_GPIO_INT_MODE_GPIO_INT_MODE_EDGE         ((uint32_t)0x1UL) /**< INT_MODE_GPIO_INT_MODE_EDGE Value */
#define MXC_S_GPIO_INT_MODE_GPIO_INT_MODE_EDGE         (MXC_V_GPIO_INT_MODE_GPIO_INT_MODE_EDGE << MXC_F_GPIO_INT_MODE_GPIO_INT_MODE_POS) /**< INT_MODE_GPIO_INT_MODE_EDGE Setting */

