analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gpio_regs.h
/**@} end of group GPIO_INT_MODE_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_POL GPIO_INT_POL
 * @brief    GPIO Interrupt Polarity Register. Each bit in this register controls the
 *           interrupt polarity setting for one GPIO pin in the associated port.
 * @{
 */
#define MXC_F_GPIO_INT_POL_GPIO_INT_POL_POS            0 /**< INT_POL_GPIO_INT_POL Position */
#define MXC_F_GPIO_INT_POL_GPIO_INT_POL                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_POL_GPIO_INT_POL_POS)) /**< INT_POL_GPIO_INT_POL Mask */
#define MXC_V_GPIO_INT_POL_GPIO_INT_POL_FALLING        ((uint32_t)0x0UL) /**< INT_POL_GPIO_INT_POL_FALLING Value */
#define MXC_S_GPIO_INT_POL_GPIO_INT_POL_FALLING        (MXC_V_GPIO_INT_POL_GPIO_INT_POL_FALLING << MXC_F_GPIO_INT_POL_GPIO_INT_POL_POS) /**< INT_POL_GPIO_INT_POL_FALLING Setting */
#define MXC_V_GPIO_INT_POL_GPIO_INT_POL_RISING         ((uint32_t)0x1UL) /**< INT_POL_GPIO_INT_POL_RISING Value */
#define MXC_S_GPIO_INT_POL_GPIO_INT_POL_RISING         (MXC_V_GPIO_INT_POL_GPIO_INT_POL_RISING << MXC_F_GPIO_INT_POL_GPIO_INT_POL_POS) /**< INT_POL_GPIO_INT_POL_RISING Setting */

/**@} end of group GPIO_INT_POL_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_IN_EN GPIO_IN_EN
 * @brief    GPIO Port Input Enable.
 * @{
 */
#define MXC_F_GPIO_IN_EN_GPIO_IN_EN_POS                0 /**< IN_EN_GPIO_IN_EN Position */
#define MXC_F_GPIO_IN_EN_GPIO_IN_EN                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_IN_EN_GPIO_IN_EN_POS)) /**< IN_EN_GPIO_IN_EN Mask */
#define MXC_V_GPIO_IN_EN_GPIO_IN_EN_DIS                ((uint32_t)0x0UL) /**< IN_EN_GPIO_IN_EN_DIS Value */
#define MXC_S_GPIO_IN_EN_GPIO_IN_EN_DIS                (MXC_V_GPIO_IN_EN_GPIO_IN_EN_DIS << MXC_F_GPIO_IN_EN_GPIO_IN_EN_POS) /**< IN_EN_GPIO_IN_EN_DIS Setting */
#define MXC_V_GPIO_IN_EN_GPIO_IN_EN_EN                 ((uint32_t)0x1UL) /**< IN_EN_GPIO_IN_EN_EN Value */
#define MXC_S_GPIO_IN_EN_GPIO_IN_EN_EN                 (MXC_V_GPIO_IN_EN_GPIO_IN_EN_EN << MXC_F_GPIO_IN_EN_GPIO_IN_EN_POS) /**< IN_EN_GPIO_IN_EN_EN Setting */

/**@} end of group GPIO_IN_EN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_EN GPIO_INT_EN
 * @brief    GPIO Interrupt Enable Register. Each bit in this register controls the GPIO
 *           interrupt enable for the associated pin on the GPIO port.
 * @{
 */
#define MXC_F_GPIO_INT_EN_GPIO_INT_EN_POS              0 /**< INT_EN_GPIO_INT_EN Position */
#define MXC_F_GPIO_INT_EN_GPIO_INT_EN                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_EN_GPIO_INT_EN_POS)) /**< INT_EN_GPIO_INT_EN Mask */
#define MXC_V_GPIO_INT_EN_GPIO_INT_EN_DIS              ((uint32_t)0x0UL) /**< INT_EN_GPIO_INT_EN_DIS Value */
#define MXC_S_GPIO_INT_EN_GPIO_INT_EN_DIS              (MXC_V_GPIO_INT_EN_GPIO_INT_EN_DIS << MXC_F_GPIO_INT_EN_GPIO_INT_EN_POS) /**< INT_EN_GPIO_INT_EN_DIS Setting */
#define MXC_V_GPIO_INT_EN_GPIO_INT_EN_EN               ((uint32_t)0x1UL) /**< INT_EN_GPIO_INT_EN_EN Value */
#define MXC_S_GPIO_INT_EN_GPIO_INT_EN_EN               (MXC_V_GPIO_INT_EN_GPIO_INT_EN_EN << MXC_F_GPIO_INT_EN_GPIO_INT_EN_POS) /**< INT_EN_GPIO_INT_EN_EN Setting */

/**@} end of group GPIO_INT_EN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_EN_SET GPIO_INT_EN_SET
 * @brief    GPIO Interrupt Enable Set. Writing a 1 to one or more bits in this register sets
 *           the bits in the same positions in GPIO_INT_EN to 1, without affecting other bits
 *           in that register.
 * @{
 */
#define MXC_F_GPIO_INT_EN_SET_GPIO_INT_EN_SET_POS      0 /**< INT_EN_SET_GPIO_INT_EN_SET Position */
#define MXC_F_GPIO_INT_EN_SET_GPIO_INT_EN_SET          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_EN_SET_GPIO_INT_EN_SET_POS)) /**< INT_EN_SET_GPIO_INT_EN_SET Mask */
#define MXC_V_GPIO_INT_EN_SET_GPIO_INT_EN_SET_NO       ((uint32_t)0x0UL) /**< INT_EN_SET_GPIO_INT_EN_SET_NO Value */
#define MXC_S_GPIO_INT_EN_SET_GPIO_INT_EN_SET_NO       (MXC_V_GPIO_INT_EN_SET_GPIO_INT_EN_SET_NO << MXC_F_GPIO_INT_EN_SET_GPIO_INT_EN_SET_POS) /**< INT_EN_SET_GPIO_INT_EN_SET_NO Setting */
#define MXC_V_GPIO_INT_EN_SET_GPIO_INT_EN_SET_SET      ((uint32_t)0x1UL) /**< INT_EN_SET_GPIO_INT_EN_SET_SET Value */
#define MXC_S_GPIO_INT_EN_SET_GPIO_INT_EN_SET_SET      (MXC_V_GPIO_INT_EN_SET_GPIO_INT_EN_SET_SET << MXC_F_GPIO_INT_EN_SET_GPIO_INT_EN_SET_POS) /**< INT_EN_SET_GPIO_INT_EN_SET_SET Setting */

/**@} end of group GPIO_INT_EN_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_EN_CLR GPIO_INT_EN_CLR
 * @brief    GPIO Interrupt Enable Clear. Writing a 1 to one or more bits in this register
 *           clears the bits in the same positions in GPIO_INT_EN to 0, without affecting
 *           other bits in that register.
 * @{
 */
#define MXC_F_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_POS      0 /**< INT_EN_CLR_GPIO_INT_EN_CLR Position */
#define MXC_F_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_POS)) /**< INT_EN_CLR_GPIO_INT_EN_CLR Mask */
#define MXC_V_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_NO       ((uint32_t)0x0UL) /**< INT_EN_CLR_GPIO_INT_EN_CLR_NO Value */
#define MXC_S_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_NO       (MXC_V_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_NO << MXC_F_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_POS) /**< INT_EN_CLR_GPIO_INT_EN_CLR_NO Setting */
#define MXC_V_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_CLEAR    ((uint32_t)0x1UL) /**< INT_EN_CLR_GPIO_INT_EN_CLR_CLEAR Value */
#define MXC_S_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_CLEAR    (MXC_V_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_CLEAR << MXC_F_GPIO_INT_EN_CLR_GPIO_INT_EN_CLR_POS) /**< INT_EN_CLR_GPIO_INT_EN_CLR_CLEAR Setting */

/**@} end of group GPIO_INT_EN_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_STAT GPIO_INT_STAT
 * @brief    GPIO Interrupt Status Register. Each bit in this register contains the pending
 *           interrupt status for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_INT_STAT_GPIO_INT_STAT_POS          0 /**< INT_STAT_GPIO_INT_STAT Position */
#define MXC_F_GPIO_INT_STAT_GPIO_INT_STAT              ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_STAT_GPIO_INT_STAT_POS)) /**< INT_STAT_GPIO_INT_STAT Mask */
#define MXC_V_GPIO_INT_STAT_GPIO_INT_STAT_NO           ((uint32_t)0x0UL) /**< INT_STAT_GPIO_INT_STAT_NO Value */
#define MXC_S_GPIO_INT_STAT_GPIO_INT_STAT_NO           (MXC_V_GPIO_INT_STAT_GPIO_INT_STAT_NO << MXC_F_GPIO_INT_STAT_GPIO_INT_STAT_POS) /**< INT_STAT_GPIO_INT_STAT_NO Setting */
#define MXC_V_GPIO_INT_STAT_GPIO_INT_STAT_PENDING      ((uint32_t)0x1UL) /**< INT_STAT_GPIO_INT_STAT_PENDING Value */
#define MXC_S_GPIO_INT_STAT_GPIO_INT_STAT_PENDING      (MXC_V_GPIO_INT_STAT_GPIO_INT_STAT_PENDING << MXC_F_GPIO_INT_STAT_GPIO_INT_STAT_POS) /**< INT_STAT_GPIO_INT_STAT_PENDING Setting */

/**@} end of group GPIO_INT_STAT_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_CLR GPIO_INT_CLR
 * @brief    GPIO Status Clear. Writing a 1 to one or more bits in this register clears the
 *           bits in the same positions in GPIO_INT_STAT to 0, without affecting other bits
 *           in that register.
 * @{
 */
#define MXC_F_GPIO_INT_CLR_GPIO_INT_CLR_POS            0 /**< INT_CLR_GPIO_INT_CLR Position */
#define MXC_F_GPIO_INT_CLR_GPIO_INT_CLR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_CLR_GPIO_INT_CLR_POS)) /**< INT_CLR_GPIO_INT_CLR Mask */
#define MXC_V_GPIO_INT_CLR_GPIO_INT_CLR_NO             ((uint32_t)0x0UL) /**< INT_CLR_GPIO_INT_CLR_NO Value */
#define MXC_S_GPIO_INT_CLR_GPIO_INT_CLR_NO             (MXC_V_GPIO_INT_CLR_GPIO_INT_CLR_NO << MXC_F_GPIO_INT_CLR_GPIO_INT_CLR_POS) /**< INT_CLR_GPIO_INT_CLR_NO Setting */
#define MXC_V_GPIO_INT_CLR_GPIO_INT_CLR_CLEAR          ((uint32_t)0x1UL) /**< INT_CLR_GPIO_INT_CLR_CLEAR Value */
#define MXC_S_GPIO_INT_CLR_GPIO_INT_CLR_CLEAR          (MXC_V_GPIO_INT_CLR_GPIO_INT_CLR_CLEAR << MXC_F_GPIO_INT_CLR_GPIO_INT_CLR_POS) /**< INT_CLR_GPIO_INT_CLR_CLEAR Setting */

/**@} end of group GPIO_INT_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_WAKE_EN GPIO_WAKE_EN
 * @brief    GPIO Wake Enable Register. Each bit in this register controls the PMU wakeup
 *           enable for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_WAKE_EN_GPIO_WAKE_EN_POS            0 /**< WAKE_EN_GPIO_WAKE_EN Position */
#define MXC_F_GPIO_WAKE_EN_GPIO_WAKE_EN                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_WAKE_EN_GPIO_WAKE_EN_POS)) /**< WAKE_EN_GPIO_WAKE_EN Mask */
#define MXC_V_GPIO_WAKE_EN_GPIO_WAKE_EN_DIS            ((uint32_t)0x0UL) /**< WAKE_EN_GPIO_WAKE_EN_DIS Value */
#define MXC_S_GPIO_WAKE_EN_GPIO_WAKE_EN_DIS            (MXC_V_GPIO_WAKE_EN_GPIO_WAKE_EN_DIS << MXC_F_GPIO_WAKE_EN_GPIO_WAKE_EN_POS) /**< WAKE_EN_GPIO_WAKE_EN_DIS Setting */
#define MXC_V_GPIO_WAKE_EN_GPIO_WAKE_EN_EN             ((uint32_t)0x1UL) /**< WAKE_EN_GPIO_WAKE_EN_EN Value */
#define MXC_S_GPIO_WAKE_EN_GPIO_WAKE_EN_EN             (MXC_V_GPIO_WAKE_EN_GPIO_WAKE_EN_EN << MXC_F_GPIO_WAKE_EN_GPIO_WAKE_EN_POS) /**< WAKE_EN_GPIO_WAKE_EN_EN Setting */

/**@} end of group GPIO_WAKE_EN_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_WAKE_EN_SET GPIO_WAKE_EN_SET
 * @brief    GPIO Wake Enable Set. Writing a 1 to one or more bits in this register sets the
 *           bits in the same positions in GPIO_WAKE_EN to 1, without affecting other bits in
 *           that register.
 * @{
 */
#define MXC_F_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_POS    0 /**< WAKE_EN_SET_GPIO_WAKE_EN_SET Position */
#define MXC_F_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET        ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_POS)) /**< WAKE_EN_SET_GPIO_WAKE_EN_SET Mask */
#define MXC_V_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_NO     ((uint32_t)0x0UL) /**< WAKE_EN_SET_GPIO_WAKE_EN_SET_NO Value */
#define MXC_S_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_NO     (MXC_V_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_NO << MXC_F_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_POS) /**< WAKE_EN_SET_GPIO_WAKE_EN_SET_NO Setting */
#define MXC_V_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_SET    ((uint32_t)0x1UL) /**< WAKE_EN_SET_GPIO_WAKE_EN_SET_SET Value */
#define MXC_S_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_SET    (MXC_V_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_SET << MXC_F_GPIO_WAKE_EN_SET_GPIO_WAKE_EN_SET_POS) /**< WAKE_EN_SET_GPIO_WAKE_EN_SET_SET Setting */

/**@} end of group GPIO_WAKE_EN_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_WAKE_EN_CLR GPIO_WAKE_EN_CLR
 * @brief    GPIO Wake Enable Clear. Writing a 1 to one or more bits in this register clears
 *           the bits in the same positions in GPIO_WAKE_EN to 0, without affecting other
 *           bits in that register.
 * @{
 */
#define MXC_F_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_POS    0 /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR Position */
#define MXC_F_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR        ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_POS)) /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR Mask */
#define MXC_V_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_NO     ((uint32_t)0x0UL) /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR_NO Value */
#define MXC_S_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_NO     (MXC_V_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_NO << MXC_F_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_POS) /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR_NO Setting */
#define MXC_V_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_CLEAR  ((uint32_t)0x1UL) /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR_CLEAR Value */
#define MXC_S_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_CLEAR  (MXC_V_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_CLEAR << MXC_F_GPIO_WAKE_EN_CLR_GPIO_WAKE_EN_CLR_POS) /**< WAKE_EN_CLR_GPIO_WAKE_EN_CLR_CLEAR Setting */

