analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/gpio_regs.h
/**@} end of group GPIO_WAKE_EN_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_INT_DUAL_EDGE GPIO_INT_DUAL_EDGE
 * @brief    GPIO Interrupt Dual Edge Mode Register. Each bit in this register selects dual
 *           edge mode for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_POS 0 /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE Position */
#define MXC_F_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_POS)) /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE Mask */
#define MXC_V_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_NO ((uint32_t)0x0UL) /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_NO Value */
#define MXC_S_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_NO (MXC_V_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_NO << MXC_F_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_POS) /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_NO Setting */
#define MXC_V_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_DUAL ((uint32_t)0x1UL) /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_DUAL Value */
#define MXC_S_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_DUAL (MXC_V_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_DUAL << MXC_F_GPIO_INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_POS) /**< INT_DUAL_EDGE_GPIO_INT_DUAL_EDGE_DUAL Setting */

/**@} end of group GPIO_INT_DUAL_EDGE_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_PDPU_SEL0 GPIO_PDPU_SEL0
 * @brief    GPIO Input Mode Config 1. Each bit in this register enables the weak pull-up for
 *           the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_POS        0 /**< PDPU_SEL0_GPIO_PDPU_SEL0 Position */
#define MXC_F_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0            ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_POS)) /**< PDPU_SEL0_GPIO_PDPU_SEL0 Mask */
#define MXC_V_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_IMPEDANCE  ((uint32_t)0x0UL) /**< PDPU_SEL0_GPIO_PDPU_SEL0_IMPEDANCE Value */
#define MXC_S_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_IMPEDANCE  (MXC_V_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_IMPEDANCE << MXC_F_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_POS) /**< PDPU_SEL0_GPIO_PDPU_SEL0_IMPEDANCE Setting */
#define MXC_V_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_PU         ((uint32_t)0x1UL) /**< PDPU_SEL0_GPIO_PDPU_SEL0_PU Value */
#define MXC_S_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_PU         (MXC_V_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_PU << MXC_F_GPIO_PDPU_SEL0_GPIO_PDPU_SEL0_POS) /**< PDPU_SEL0_GPIO_PDPU_SEL0_PU Setting */

/**@} end of group GPIO_PDPU_SEL0_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_PDPU_SEL1 GPIO_PDPU_SEL1
 * @brief    GPIO Input Mode Config 2. Each bit in this register enables the pull-down for
 *           the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_POS        0 /**< PDPU_SEL1_GPIO_PDPU_SEL1 Position */
#define MXC_F_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1            ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_POS)) /**< PDPU_SEL1_GPIO_PDPU_SEL1 Mask */
#define MXC_V_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_IMPEDANCE  ((uint32_t)0x0UL) /**< PDPU_SEL1_GPIO_PDPU_SEL1_IMPEDANCE Value */
#define MXC_S_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_IMPEDANCE  (MXC_V_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_IMPEDANCE << MXC_F_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_POS) /**< PDPU_SEL1_GPIO_PDPU_SEL1_IMPEDANCE Setting */
#define MXC_V_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_PD         ((uint32_t)0x1UL) /**< PDPU_SEL1_GPIO_PDPU_SEL1_PD Value */
#define MXC_S_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_PD         (MXC_V_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_PD << MXC_F_GPIO_PDPU_SEL1_GPIO_PDPU_SEL1_POS) /**< PDPU_SEL1_GPIO_PDPU_SEL1_PD Setting */

/**@} end of group GPIO_PDPU_SEL1_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_AF_SEL GPIO_AF_SEL
 * @brief    GPIO Alternate Function Enable Register. Each bit in this register selects
 *           between primary/secondary functions for the associated GPIO pin in this port.
 * @{
 */
#define MXC_F_GPIO_AF_SEL_GPIO_AF_SEL_POS              0 /**< AF_SEL_GPIO_AF_SEL Position */
#define MXC_F_GPIO_AF_SEL_GPIO_AF_SEL                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_AF_SEL_GPIO_AF_SEL_POS)) /**< AF_SEL_GPIO_AF_SEL Mask */
#define MXC_V_GPIO_AF_SEL_GPIO_AF_SEL_PRIMARY          ((uint32_t)0x0UL) /**< AF_SEL_GPIO_AF_SEL_PRIMARY Value */
#define MXC_S_GPIO_AF_SEL_GPIO_AF_SEL_PRIMARY          (MXC_V_GPIO_AF_SEL_GPIO_AF_SEL_PRIMARY << MXC_F_GPIO_AF_SEL_GPIO_AF_SEL_POS) /**< AF_SEL_GPIO_AF_SEL_PRIMARY Setting */
#define MXC_V_GPIO_AF_SEL_GPIO_AF_SEL_SECONDARY        ((uint32_t)0x1UL) /**< AF_SEL_GPIO_AF_SEL_SECONDARY Value */
#define MXC_S_GPIO_AF_SEL_GPIO_AF_SEL_SECONDARY        (MXC_V_GPIO_AF_SEL_GPIO_AF_SEL_SECONDARY << MXC_F_GPIO_AF_SEL_GPIO_AF_SEL_POS) /**< AF_SEL_GPIO_AF_SEL_SECONDARY Setting */

/**@} end of group GPIO_AF_SEL_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_AF_SEL_SET GPIO_AF_SEL_SET
 * @brief    GPIO Alternate Function Selectset. Writing a 1 to one or more bits in this
 *           register sets the bits in the same positions in GPIO_EN1 to 1, without affecting
 *           other bits in that register.
 * @{
 */
#define MXC_F_GPIO_AF_SEL_SET_AF_SEL_SET_POS           0 /**< AF_SEL_SET_AF_SEL_SET Position */
#define MXC_F_GPIO_AF_SEL_SET_AF_SEL_SET               ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_AF_SEL_SET_AF_SEL_SET_POS)) /**< AF_SEL_SET_AF_SEL_SET Mask */
#define MXC_V_GPIO_AF_SEL_SET_AF_SEL_SET_NO            ((uint32_t)0x0UL) /**< AF_SEL_SET_AF_SEL_SET_NO Value */
#define MXC_S_GPIO_AF_SEL_SET_AF_SEL_SET_NO            (MXC_V_GPIO_AF_SEL_SET_AF_SEL_SET_NO << MXC_F_GPIO_AF_SEL_SET_AF_SEL_SET_POS) /**< AF_SEL_SET_AF_SEL_SET_NO Setting */
#define MXC_V_GPIO_AF_SEL_SET_AF_SEL_SET_SET           ((uint32_t)0x1UL) /**< AF_SEL_SET_AF_SEL_SET_SET Value */
#define MXC_S_GPIO_AF_SEL_SET_AF_SEL_SET_SET           (MXC_V_GPIO_AF_SEL_SET_AF_SEL_SET_SET << MXC_F_GPIO_AF_SEL_SET_AF_SEL_SET_POS) /**< AF_SEL_SET_AF_SEL_SET_SET Setting */

/**@} end of group GPIO_AF_SEL_SET_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_AF_SEL_CLR GPIO_AF_SEL_CLR
 * @brief    GPIO Alternate Function Clear. Writing a 1 to one or more bits in this register
 *           clears the bits in the same positions in GPIO_EN1 to 0, without affecting other
 *           bits in that register.
 * @{
 */
#define MXC_F_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_POS      0 /**< AF_SEL_CLR_GPIO_AF_SEL_CLR Position */
#define MXC_F_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR          ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_POS)) /**< AF_SEL_CLR_GPIO_AF_SEL_CLR Mask */
#define MXC_V_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_NO       ((uint32_t)0x0UL) /**< AF_SEL_CLR_GPIO_AF_SEL_CLR_NO Value */
#define MXC_S_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_NO       (MXC_V_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_NO << MXC_F_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_POS) /**< AF_SEL_CLR_GPIO_AF_SEL_CLR_NO Setting */
#define MXC_V_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_CLEAR    ((uint32_t)0x1UL) /**< AF_SEL_CLR_GPIO_AF_SEL_CLR_CLEAR Value */
#define MXC_S_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_CLEAR    (MXC_V_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_CLEAR << MXC_F_GPIO_AF_SEL_CLR_GPIO_AF_SEL_CLR_POS) /**< AF_SEL_CLR_GPIO_AF_SEL_CLR_CLEAR Setting */

/**@} end of group GPIO_AF_SEL_CLR_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_DS_SEL0 GPIO_DS_SEL0
 * @brief    GPIO Drive Strength  Register. Each bit in this register selects the drive
 *           strength for the associated GPIO pin in this port. Refer to the Datasheet for
 *           sink/source current of GPIO pins in each mode. The total drive strength
 *           multiplier is the multiplication between the two drive strength select
 *           registers.
 * @{
 */
#define MXC_F_GPIO_DS_SEL0_GPIO_DS_SEL0_POS            0 /**< DS_SEL0_GPIO_DS_SEL0 Position */
#define MXC_F_GPIO_DS_SEL0_GPIO_DS_SEL0                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_DS_SEL0_GPIO_DS_SEL0_POS)) /**< DS_SEL0_GPIO_DS_SEL0 Mask */
#define MXC_V_GPIO_DS_SEL0_GPIO_DS_SEL0_1X             ((uint32_t)0x0UL) /**< DS_SEL0_GPIO_DS_SEL0_1X Value */
#define MXC_S_GPIO_DS_SEL0_GPIO_DS_SEL0_1X             (MXC_V_GPIO_DS_SEL0_GPIO_DS_SEL0_1X << MXC_F_GPIO_DS_SEL0_GPIO_DS_SEL0_POS) /**< DS_SEL0_GPIO_DS_SEL0_1X Setting */
#define MXC_V_GPIO_DS_SEL0_GPIO_DS_SEL0_2X             ((uint32_t)0x1UL) /**< DS_SEL0_GPIO_DS_SEL0_2X Value */
#define MXC_S_GPIO_DS_SEL0_GPIO_DS_SEL0_2X             (MXC_V_GPIO_DS_SEL0_GPIO_DS_SEL0_2X << MXC_F_GPIO_DS_SEL0_GPIO_DS_SEL0_POS) /**< DS_SEL0_GPIO_DS_SEL0_2X Setting */

/**@} end of group GPIO_DS_SEL0_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_DS_SEL1 GPIO_DS_SEL1
 * @brief    GPIO Drive Strength 1 Register. Each bit in this register selects the drive
 *           strength for the associated GPIO pin in this port. Refer to the Datasheet for
 *           sink/source current of GPIO pins in each mode. The total drive strength
 *           multiplier is the multiplication between the two drive strength select
 *           registers.
 * @{
 */
#define MXC_F_GPIO_DS_SEL1_GPIO_DS_SEL1_POS            0 /**< DS_SEL1_GPIO_DS_SEL1 Position */
#define MXC_F_GPIO_DS_SEL1_GPIO_DS_SEL1                ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_DS_SEL1_GPIO_DS_SEL1_POS)) /**< DS_SEL1_GPIO_DS_SEL1 Mask */
#define MXC_V_GPIO_DS_SEL1_GPIO_DS_SEL1_1X             ((uint32_t)0x0UL) /**< DS_SEL1_GPIO_DS_SEL1_1X Value */
#define MXC_S_GPIO_DS_SEL1_GPIO_DS_SEL1_1X             (MXC_V_GPIO_DS_SEL1_GPIO_DS_SEL1_1X << MXC_F_GPIO_DS_SEL1_GPIO_DS_SEL1_POS) /**< DS_SEL1_GPIO_DS_SEL1_1X Setting */
#define MXC_V_GPIO_DS_SEL1_GPIO_DS_SEL1_4X             ((uint32_t)0x1UL) /**< DS_SEL1_GPIO_DS_SEL1_4X Value */
#define MXC_S_GPIO_DS_SEL1_GPIO_DS_SEL1_4X             (MXC_V_GPIO_DS_SEL1_GPIO_DS_SEL1_4X << MXC_F_GPIO_DS_SEL1_GPIO_DS_SEL1_POS) /**< DS_SEL1_GPIO_DS_SEL1_4X Setting */

/**@} end of group GPIO_DS_SEL1_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_PSSEL GPIO_PSSEL
 * @brief    GPIO Pull Select Mode.
 * @{
 */
#define MXC_F_GPIO_PSSEL_GPIO_PSSEL_POS                0 /**< PSSEL_GPIO_PSSEL Position */
#define MXC_F_GPIO_PSSEL_GPIO_PSSEL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_PSSEL_GPIO_PSSEL_POS)) /**< PSSEL_GPIO_PSSEL Mask */
#define MXC_V_GPIO_PSSEL_GPIO_PSSEL_WEAK_PDPU          ((uint32_t)0x0UL) /**< PSSEL_GPIO_PSSEL_WEAK_PDPU Value */
#define MXC_S_GPIO_PSSEL_GPIO_PSSEL_WEAK_PDPU          (MXC_V_GPIO_PSSEL_GPIO_PSSEL_WEAK_PDPU << MXC_F_GPIO_PSSEL_GPIO_PSSEL_POS) /**< PSSEL_GPIO_PSSEL_WEAK_PDPU Setting */
#define MXC_V_GPIO_PSSEL_GPIO_PSSEL_STRONG_PDPU        ((uint32_t)0x1UL) /**< PSSEL_GPIO_PSSEL_STRONG_PDPU Value */
#define MXC_S_GPIO_PSSEL_GPIO_PSSEL_STRONG_PDPU        (MXC_V_GPIO_PSSEL_GPIO_PSSEL_STRONG_PDPU << MXC_F_GPIO_PSSEL_GPIO_PSSEL_POS) /**< PSSEL_GPIO_PSSEL_STRONG_PDPU Setting */

/**@} end of group GPIO_PSSEL_Register */

/**
 * @ingroup  gpio_registers
 * @defgroup GPIO_VSSEL GPIO_VSSEL
 * @brief    GPIO Voltage Select.
 * @{
 */
#define MXC_F_GPIO_VSSEL_GPIO_VSSEL_POS                0 /**< VSSEL_GPIO_VSSEL Position */
#define MXC_F_GPIO_VSSEL_GPIO_VSSEL                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_GPIO_VSSEL_GPIO_VSSEL_POS)) /**< VSSEL_GPIO_VSSEL Mask */
#define MXC_V_GPIO_VSSEL_GPIO_VSSEL_VDDIO              ((uint32_t)0x0UL) /**< VSSEL_GPIO_VSSEL_VDDIO Value */
#define MXC_S_GPIO_VSSEL_GPIO_VSSEL_VDDIO              (MXC_V_GPIO_VSSEL_GPIO_VSSEL_VDDIO << MXC_F_GPIO_VSSEL_GPIO_VSSEL_POS) /**< VSSEL_GPIO_VSSEL_VDDIO Setting */
#define MXC_V_GPIO_VSSEL_GPIO_VSSEL_VDDIOH             ((uint32_t)0x1UL) /**< VSSEL_GPIO_VSSEL_VDDIOH Value */
#define MXC_S_GPIO_VSSEL_GPIO_VSSEL_VDDIOH             (MXC_V_GPIO_VSSEL_GPIO_VSSEL_VDDIOH << MXC_F_GPIO_VSSEL_GPIO_VSSEL_POS) /**< VSSEL_GPIO_VSSEL_VDDIOH Setting */

/**@} end of group GPIO_VSSEL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_GPIO_REGS_H_
